MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX550F256L.atdf
<?xml version="1.0" encoding="UTF-8"?>
<!--
 Copyright (c) 2019 Microchip Technology Inc.
 SPDX-License-Identifier: Apache-2.0
 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at
 http://www.apache.org/licenses/LICENSE-2.0
 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
-->

<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="0.6" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
<file timestamp="2019-04-22T15:51:44Z"/>
<variants>
   <variant package="TQFPTFBGA100" pinout="TQFPTFBGA100" speedmax="50000000" tempmax="85" tempmin="-40" vccmax="3.6" vccmin="2.3" />
</variants>
<devices>
   <device architecture="MIPS" family="PIC32MX" name="PIC32MX550F256L" series="PIC32MX">
      <address-spaces>
         <address-space endianness="little" id="base" name="base" size="0x100000000" start="0">
            <memory-segment exec="" name="emulation" rw="" size="0x100000" start="0xff300000" type="" />
            <memory-segment exec="" name="devid" rw="" size="0x0" start="0xffffffff" type="" />
            <memory-segment exec="" name="code" rw="" size="0x40000" start="0x1d000000" type="" />
            <memory-segment exec="" name="bootconfig" rw="" size="0xbf0" start="0x1fc00000" type="" />
            <memory-segment exec="" name="kseg1_data_mem" rw="" size="0x8000" start="0x0" type="" />
            <memory-segment exec="" name="periph0" rw="" size="0xa400" start="0x1f800000" type="" />
            <memory-segment exec="" name="periph1" rw="" size="0xdbc" start="0x1f80f000" type="" />
            <memory-segment exec="" name="periph2" rw="" size="0xe000" start="0x1f880000" type="" />
         </address-space>
         <address-space endianness="" id="config" name="config" size="0x10" start="0x1fc00bf0" />
      </address-spaces>
      <property-groups>
         <property-group name="SIGNATURES">
            <property name="JTAGID" value="" />
            <property name="CHIPID_CIDR" value="" />
            <property name="CHIPID_EXID" value="" />
         </property-group>
      </property-groups>
      <parameters>
         <param caption="Number of interrupt priority levels" name="__INT_PRIO_LEVELS" value="7" />
         <param caption="Number of interrupt subpriority levels" name="__INT_SUBPRIO_LEVELS" value="4" />
         <param caption="Number of interrupt shadow register sets" name="__INT_NUM_SHADOW_SETS" value="0" />
         <param caption="Number of oscillators present" name="__NUM_OSC" value="1"/>
         <param caption="System Clock Default Frequency" name="__SYS_DEF_FREQ" value="48000000"/>
         <param caption="Peripheral Bus Default Clock Frequency" name="__PB_DEF_FREQ" value="48000000"/>
         <param caption="Reference Clock Default Frequency" name="__REFCLK_DEF_FREQ" value="8000000"/>
         <param caption="Primary Oscillator Input Default Frequency" name="__POSC_DEF_FREQ" value="8000000"/>
         <param caption="Secondary Oscillator Input Default Frequency" name="__SOSC_DEF_FREQ" value="32768"/>
         <param caption="Peripheral Bus Default Divider Value" name="__PB_DEF_DIV" value="1"/>
         <param caption="Number of DMA Channels" name="__NUM_DMA_CHANNELS" value="4"/>
      </parameters>
      <peripherals>
         <module id="02486" name="ADC" version="1">
            <instance name="ADC">
               <register-group address-space="periph0" name="ADC" name-in-module="ADC" offset="0x1f809000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00747" name="BMX" version="">
            <instance name="BMX">
               <register-group address-space="periph2" name="BMX" name-in-module="BMX" offset="0x1f882000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01152" name="CAN" version="">
            <instance name="CAN1">
               <register-group address-space="periph2" name="CAN" name-in-module="CAN" offset="0x1f88b000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02495" name="CFG" version="">
            <instance name="CFG">
               <register-group address-space="periph1" name="CFG" name-in-module="CFG" offset="0x1f80f200" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00866" name="CMP" version="">
            <instance name="CMP">
               <register-group address-space="periph0" name="CMP" name-in-module="CMP" offset="0x1f80a000" />
               <parameters>
                  <param name=""/>
               </parameters>
            </instance>
         </module>
         <module id="00000" name="CORE" version="">
            <instance name="CORE">
               <register-group address-space="" name="CORE" name-in-module="CORE" offset="0x0" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01461" name="CTMU" version="">
            <instance name="CTMU">
               <register-group address-space="periph0" name="CTMU" name-in-module="CTMU" offset="0x1f80a200" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00800" name="CVR" version="">
            <instance name="CVR">
               <register-group address-space="periph0" name="CVR" name-in-module="CVR" offset="0x1f809800" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00735" name="DMAC" version="">
            <instance name="DMAC">
               <register-group address-space="periph2" name="DMAC" name-in-module="DMAC" offset="0x1f883000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00774" name="I2C" version="">
            <instance name="I2C1">
               <register-group address-space="periph0" name="I2C" name-in-module="I2C" offset="0x1f805000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="I2C2">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
