MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX550F256L.atdf
         <register caption="CAN Receive FIFO Overflow Status Register" name="C1RXOVF" offset="0x60" rw="R" size="4">
            <bitfield caption="FIFOx Receive Overflow Interrupt Pending bit" mask="0xFFFFFFFF" name="RXOVF" values="C1RXOVF__RXOVF" />
         </register>
         <register caption="CAN Timer Register" name="C1TMR" offset="0x70" rw="RW" size="4">
            <bitfield caption="CAN Time Stamp Timer Prescaler bits" mask="0x0000FFFF" name="CANTSPRE" values="C1TMR__CANTSPRE" />
            <bitfield mask="0xFFFF0000" name="CANTS" />
         </register>
         <register caption="CAN Acceptance Filter Mask " name="C1RXM0" offset="0x80" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXM0__EID" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x00080000" name="MIDE" values="C1RXM0__MIDE" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXM0__SID" />
         </register>
         <register caption="CAN Acceptance Filter Mask " name="C1RXM1" offset="0x90" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXM1__EID" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x00080000" name="MIDE" values="C1RXM1__MIDE" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXM1__SID" />
         </register>
         <register caption="CAN Acceptance Filter Mask " name="C1RXM2" offset="0xa0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXM2__EID" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x00080000" name="MIDE" values="C1RXM2__MIDE" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXM2__SID" />
         </register>
         <register caption="CAN Acceptance Filter Mask " name="C1RXM3" offset="0xb0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXM3__EID" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x00080000" name="MIDE" values="C1RXM3__MIDE" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXM3__SID" />
         </register>
         <register caption="CAN Filter Control Register 0" name="C1FLTCON0" offset="0xc0" rw="RW" size="4">
            <bitfield caption="FIFO Selection bits" mask="0x0000001F" name="FSEL0" values="C1FLTCON0__FSEL0" />
            <bitfield caption="Filter 0 Mask Select bits" mask="0x00000060" name="MSEL0" values="C1FLTCON0__MSEL0" />
            <bitfield caption="Filter 0 Enable bit" mask="0x00000080" name="FLTEN0" values="C1FLTCON0__FLTEN0" />
            <bitfield caption="FIFO Selection bits" mask="0x00001F00" name="FSEL1" values="C1FLTCON0__FSEL1" />
            <bitfield caption="Filter 1 Mask Select bits" mask="0x00006000" name="MSEL1" values="C1FLTCON0__MSEL1" />
            <bitfield caption="Filter 1 Enable bit" mask="0x00008000" name="FLTEN1" values="C1FLTCON0__FLTEN1" />
            <bitfield caption="FIFO Selection bits" mask="0x001F0000" name="FSEL2" values="C1FLTCON0__FSEL2" />
            <bitfield caption="Filter 2 Mask Select bits" mask="0x00600000" name="MSEL2" values="C1FLTCON0__MSEL2" />
            <bitfield caption="Filter 2 Enable bit" mask="0x00800000" name="FLTEN2" values="C1FLTCON0__FLTEN2" />
            <bitfield caption="FIFO Selection bits" mask="0x1F000000" name="FSEL3" values="C1FLTCON0__FSEL3" />
            <bitfield caption="Filter 3 Mask Select bits" mask="0x60000000" name="MSEL3" values="C1FLTCON0__MSEL3" />
            <bitfield caption="Filter 3 Enable bit" mask="0x80000000" name="FLTEN3" values="C1FLTCON0__FLTEN3" />
         </register>
         <register caption="CAN Filter Control Register 1" name="C1FLTCON1" offset="0xd0" rw="RW" size="4">
            <bitfield caption="FIFO Selection bits" mask="0x0000001F" name="FSEL4" values="C1FLTCON1__FSEL4" />
            <bitfield caption="Filter 4 Mask Select bits" mask="0x00000060" name="MSEL4" values="C1FLTCON1__MSEL4" />
            <bitfield caption="Filter 4 Enable bit" mask="0x00000080" name="FLTEN4" values="C1FLTCON1__FLTEN4" />
            <bitfield caption="FIFO Selection bits" mask="0x00001F00" name="FSEL5" values="C1FLTCON1__FSEL5" />
            <bitfield caption="Filter 5 Mask Select bits" mask="0x00006000" name="MSEL5" values="C1FLTCON1__MSEL5" />
            <bitfield caption="Filter 17 Enable bit" mask="0x00008000" name="FLTEN5" values="C1FLTCON1__FLTEN5" />
            <bitfield caption="FIFO Selection bits" mask="0x001F0000" name="FSEL6" values="C1FLTCON1__FSEL6" />
            <bitfield caption="Filter 6 Mask Select bits" mask="0x00600000" name="MSEL6" values="C1FLTCON1__MSEL6" />
            <bitfield caption="Filter 6 Enable bit" mask="0x00800000" name="FLTEN6" values="C1FLTCON1__FLTEN6" />
            <bitfield caption="FIFO Selection bits" mask="0x1F000000" name="FSEL7" values="C1FLTCON1__FSEL7" />
            <bitfield caption="Filter 7 Mask Select bits" mask="0x60000000" name="MSEL7" values="C1FLTCON1__MSEL7" />
            <bitfield caption="Filter 7 Enable bit" mask="0x80000000" name="FLTEN7" values="C1FLTCON1__FLTEN7" />
         </register>
         <register caption="CAN Filter Control Register 2" name="C1FLTCON2" offset="0xe0" rw="RW" size="4">
            <bitfield caption="FIFO Selection bits" mask="0x0000001F" name="FSEL8" values="C1FLTCON2__FSEL8" />
            <bitfield caption="Filter 8 Mask Select bits" mask="0x00000060" name="MSEL8" values="C1FLTCON2__MSEL8" />
            <bitfield caption="Filter 8 Enable bit" mask="0x00000080" name="FLTEN8" values="C1FLTCON2__FLTEN8" />
            <bitfield caption="FIFO Selection bits" mask="0x00001F00" name="FSEL9" values="C1FLTCON2__FSEL9" />
            <bitfield caption="Filter 9 Mask Select bits" mask="0x00006000" name="MSEL9" values="C1FLTCON2__MSEL9" />
            <bitfield caption="Filter 9 Enable bit" mask="0x00008000" name="FLTEN9" values="C1FLTCON2__FLTEN9" />
            <bitfield caption="FIFO Selection bits" mask="0x001F0000" name="FSEL10" values="C1FLTCON2__FSEL10" />
            <bitfield caption="Filter 10 Mask Select bits" mask="0x00600000" name="MSEL10" values="C1FLTCON2__MSEL10" />
            <bitfield caption="Filter 10 Enable bit" mask="0x00800000" name="FLTEN10" values="C1FLTCON2__FLTEN10" />
            <bitfield caption="FIFO Selection bits" mask="0x1F000000" name="FSEL11" values="C1FLTCON2__FSEL11" />
            <bitfield caption="Filter 11 Mask Select bits" mask="0x60000000" name="MSEL11" values="C1FLTCON2__MSEL11" />
            <bitfield caption="Filter 11 Enable bit" mask="0x80000000" name="FLTEN11" values="C1FLTCON2__FLTEN11" />
         </register>
         <register caption="CAN Filter Control Register 3" name="C1FLTCON3" offset="0xf0" rw="RW" size="4">
            <bitfield caption="FIFO Selection bits" mask="0x0000001F" name="FSEL12" values="C1FLTCON3__FSEL12" />
            <bitfield caption="Filter 12 Mask Select bits" mask="0x00000060" name="MSEL12" values="C1FLTCON3__MSEL12" />
            <bitfield caption="Filter 12 Enable bit" mask="0x00000080" name="FLTEN12" values="C1FLTCON3__FLTEN12" />
            <bitfield caption="FIFO Selection bits" mask="0x00001F00" name="FSEL13" values="C1FLTCON3__FSEL13" />
            <bitfield caption="Filter 13 Mask Select bits" mask="0x00006000" name="MSEL13" values="C1FLTCON3__MSEL13" />
            <bitfield caption="Filter 13 Enable bit" mask="0x00008000" name="FLTEN13" values="C1FLTCON3__FLTEN13" />
            <bitfield caption="FIFO Selection bits" mask="0x001F0000" name="FSEL14" values="C1FLTCON3__FSEL14" />
            <bitfield caption="Filter 14 Mask Select bits" mask="0x00600000" name="MSEL14" values="C1FLTCON3__MSEL14" />
            <bitfield caption="Filter 14 Enable bit" mask="0x00800000" name="FLTEN14" values="C1FLTCON3__FLTEN14" />
            <bitfield caption="FIFO Selection bits" mask="0x1F000000" name="FSEL15" values="C1FLTCON3__FSEL15" />
            <bitfield caption="Filter 15 Mask Select bits" mask="0x60000000" name="MSEL15" values="C1FLTCON3__MSEL15" />
            <bitfield caption="Filter 15 Enable bit" mask="0x80000000" name="FLTEN15" values="C1FLTCON3__FLTEN15" />
         </register>
         <register caption="CAN Filter Control Register 4" name="C1FLTCON4" offset="0x100" rw="RW" size="4">
            <bitfield caption="FIFO Selection bits" mask="0x0000001F" name="FSEL16" values="C1FLTCON4__FSEL16" />
            <bitfield caption="Filter 16 Mask Select bits" mask="0x00000060" name="MSEL16" values="C1FLTCON4__MSEL16" />
            <bitfield caption="Filter 16 Enable bit" mask="0x00000080" name="FLTEN16" values="C1FLTCON4__FLTEN16" />
            <bitfield caption="FIFO Selection bits" mask="0x00001F00" name="FSEL17" values="C1FLTCON4__FSEL17" />
            <bitfield caption="Filter 17 Mask Select bits" mask="0x00006000" name="MSEL17" values="C1FLTCON4__MSEL17" />
            <bitfield caption="Filter 13 Enable bit" mask="0x00008000" name="FLTEN17" values="C1FLTCON4__FLTEN17" />
            <bitfield caption="FIFO Selection bits" mask="0x001F0000" name="FSEL18" values="C1FLTCON4__FSEL18" />
            <bitfield caption="Filter 18 Mask Select bits" mask="0x00600000" name="MSEL18" values="C1FLTCON4__MSEL18" />
            <bitfield caption="Filter 18 Enable bit" mask="0x00800000" name="FLTEN18" values="C1FLTCON4__FLTEN18" />
            <bitfield caption="FIFO Selection bits" mask="0x1F000000" name="FSEL19" values="C1FLTCON4__FSEL19" />
            <bitfield caption="Filter 19 Mask Select bits" mask="0x60000000" name="MSEL19" values="C1FLTCON4__MSEL19" />
            <bitfield caption="Filter 19 Enable bit" mask="0x80000000" name="FLTEN19" values="C1FLTCON4__FLTEN19" />
         </register>
         <register caption="CAN Filter Control Register 5" name="C1FLTCON5" offset="0x110" rw="RW" size="4">
            <bitfield caption="FIFO Selection bits" mask="0x0000001F" name="FSEL20" values="C1FLTCON5__FSEL20" />
            <bitfield caption="Filter 20 Mask Select bits" mask="0x00000060" name="MSEL20" values="C1FLTCON5__MSEL20" />
            <bitfield caption="Filter 20 Enable bit" mask="0x00000080" name="FLTEN20" values="C1FLTCON5__FLTEN20" />
            <bitfield caption="FIFO Selection bits" mask="0x00001F00" name="FSEL21" values="C1FLTCON5__FSEL21" />
            <bitfield caption="Filter 21 Mask Select bits" mask="0x00006000" name="MSEL21" values="C1FLTCON5__MSEL21" />
            <bitfield caption="Filter 21 Enable bit" mask="0x00008000" name="FLTEN21" values="C1FLTCON5__FLTEN21" />
            <bitfield caption="FIFO Selection bits" mask="0x001F0000" name="FSEL22" values="C1FLTCON5__FSEL22" />
            <bitfield caption="Filter 22 Mask Select bits" mask="0x00600000" name="MSEL22" values="C1FLTCON5__MSEL22" />
            <bitfield caption="Filter 22 Enable bit" mask="0x00800000" name="FLTEN22" values="C1FLTCON5__FLTEN22" />
            <bitfield caption="FIFO Selection bits" mask="0x1F000000" name="FSEL23" values="C1FLTCON5__FSEL23" />
            <bitfield caption="Filter 23 Mask Select bits" mask="0x60000000" name="MSEL23" values="C1FLTCON5__MSEL23" />
            <bitfield caption="Filter 23 Enable bit" mask="0x80000000" name="FLTEN23" values="C1FLTCON5__FLTEN23" />
         </register>
         <register caption="CAN Filter Control Register 6" name="C1FLTCON6" offset="0x120" rw="RW" size="4">
            <bitfield caption="FIFO Selection bits" mask="0x0000001F" name="FSEL24" values="C1FLTCON6__FSEL24" />
            <bitfield caption="Filter 24 Mask Select bits" mask="0x00000060" name="MSEL24" values="C1FLTCON6__MSEL24" />
            <bitfield caption="Filter 24 Enable bit" mask="0x00000080" name="FLTEN24" values="C1FLTCON6__FLTEN24" />
            <bitfield caption="FIFO Selection bits" mask="0x00001F00" name="FSEL25" values="C1FLTCON6__FSEL25" />
            <bitfield caption="Filter 25 Mask Select bits" mask="0x00006000" name="MSEL25" values="C1FLTCON6__MSEL25" />
            <bitfield caption="Filter 25 Enable bit" mask="0x00008000" name="FLTEN25" values="C1FLTCON6__FLTEN25" />
            <bitfield caption="FIFO Selection bits" mask="0x001F0000" name="FSEL26" values="C1FLTCON6__FSEL26" />
            <bitfield caption="Filter 26 Mask Select bits" mask="0x00600000" name="MSEL26" values="C1FLTCON6__MSEL26" />
            <bitfield caption="Filter 26 Enable bit" mask="0x00800000" name="FLTEN26" values="C1FLTCON6__FLTEN26" />
            <bitfield caption="FIFO Selection bits" mask="0x1F000000" name="FSEL27" values="C1FLTCON6__FSEL27" />
            <bitfield caption="Filter 27 Mask Select bits" mask="0x60000000" name="MSEL27" values="C1FLTCON6__MSEL27" />
            <bitfield caption="Filter 27 Enable bit" mask="0x80000000" name="FLTEN27" values="C1FLTCON6__FLTEN27" />
         </register>
